Repository: JiongXing/NoiseClear
Catalog: VoiceClear/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, zh_hant

# common.cancel
source: 取消
en: Cancel
ja: キャンセル

# common.clear
source: 清空
en: Clear
ja: クリア

# common.completed_count
source: %lld 已完成
en: %lld completed
ja: %lld件完了済み

# common.confirm
source: 确定
en: OK
ja: OK
zh_hant: 確定

# common.error
source: 错误
en: Error
ja: エラー
zh_hant: 錯誤

# common.files_count
source: %lld 个文件
en: %lld files
ja: %lld件のファイル
zh_hant: %lld 個檔案

# common.importing_album
source: 正在从相册导入...
en: Importing from album...
ja: アルバムから読み込み中...
zh_hant: 正在從相簿匯入...

# common.importing_album_hint
source: 大文件可能需要较长时间
en: Large files may take a while
ja: 大容量ファイルは時間がかかる場合があります
zh_hant: 大檔案可能需要較長時間

# common.light
source: 轻度
en: Light
ja: 弱め
zh_hant: 輕度

# common.minutes
source: %lld分
en: %lld min

# common.minutes_seconds
source: %lld分%lld秒
en: %lld min %lld sec

# common.not_selected
source: 未选择
en: Not Selected
ja: 未選択
zh_hant: 未選擇

# common.or
source: 或
en: Or
ja: または

# common.paste
source: 粘贴
en: Paste
ja: 貼り付け
zh_hant: 粘貼

# common.seconds
source: %lld秒
en: %lld sec

# common.selected
source: 已选择
en: Selected
ja: 選択済み
zh_hant: 已選擇

# common.strong
source: 强力
en: Strong
ja: 強め
zh_hant: 強力

# conversion.action.clear_all
source: 清空全部
en: Clear all
ja: すべてクリア

# conversion.action.export_all
source: 全部导出
en: Export all
ja: すべてを書き出す
zh_hant: 全部匯出

# conversion.action.start_denoise
source: 开始降噪
en: Start denoise
ja: ノイズ除去を開始する
zh_hant: 開始降噪

# conversion.action.stop_denoise
source: 停止降噪
en: Stop denoise
ja: ノイズ除去を停止

# conversion.error.cannot_read_file_detail
source: 无法读取文件 %@: %@
en: Cannot read file %@: %@
ja: ファイル %@ を読み込めません: %@
zh_hant: 無法讀取檔案 %@: %@

# conversion.error.export_failed
source: 导出失败: %@
en: Export failed: %@
ja: 書き出しに失敗しました: %@
zh_hant: 匯出失敗: %@

# conversion.error.import_album_failed
source: 从相册导入失败: %@
en: Import from album failed: %@
ja: アルバムからの読み込みに失敗しました: %@
zh_hant: 從相簿匯入失敗: %@

# conversion.error.processing_failed
source: 处理 %@ 失败: %@
en: Processing %@ failed: %@
ja: %@ の処理に失敗しました: %@
zh_hant: 處理 %@ 失敗: %@

# conversion.importing_local_files
source: 正在导入本地文件
en: Importing local files
ja: ローカルファイルを読み込み中
zh_hant: 正在匯入本地檔案

# conversion.label.remaining
source: 剩余 %@
en: Remaining %@
ja: 残り %@
zh_hant: 剩餘 %@

# conversion.section.denoise_strength
source: 降噪强度
en: Denoise strength
ja: ノイズ除去強度
zh_hant: 降噪強度

# conversion.section.file_list
source: 文件列表
en: File list
ja: ファイル一覧
zh_hant: 檔案列表

# conversion.waveform.preview
source: 波形预览 — %@
en: Waveform preview — %@
ja: 波形プレビュー — %@
zh_hant: 波形預覽 — %@

# dropzone.ios.subtitle
source: 支持从文件或相册导入
en: Import from Files or Photos
ja: ファイルまたは写真から取り込み
zh_hant: 支持從檔案或相簿匯入

# dropzone.ios.title
source: 点击选择音频/视频文件
en: Tap to select audio/video
ja: タップして音声/動画を選択
zh_hant: 點擊選擇音訊/影片檔案

# dropzone.mac.subtitle
source: 或点击选择文件
en: Or tap to select
ja: またはクリックして選択
zh_hant: 或點擊選擇檔案

# dropzone.mac.title
source: 拖拽音频/视频文件到此处
en: Drag audio/video files here
ja: 音声/動画ファイルをここにドラッグ
zh_hant: 拖拽音訊/影片檔案到此處

# dropzone.supported_formats
source: 支持 MP3、M4A、WAV、AAC、FLAC、MP4、MOV 格式
en: Supports MP3, M4A, WAV, AAC, FLAC, MP4, MOV
ja: MP3、M4A、WAV、AAC、FLAC、MP4、MOV に対応

# file_list.action.export
source: 导出文件
en: Export file
ja: ファイルを書き出し
zh_hant: 匯出檔案

# file_list.action.remove
source: 移除文件
en: Remove file
ja: ファイルを削除
zh_hant: 移除檔案

# file_list.confirm.remove_message
source: 确定要移除「%@」吗？
en: Remove "%@"?
ja: 「%@」を削除しますか？
zh_hant: 確定要移除「%@」嗎？

# file_list.confirm.remove_title
source: 确认移除
en: Confirm removal
ja: 削除の確認
zh_hant: 確認移除

# file_list.empty
source: 暂无媒体文件
en: No media files
ja: メディアファイルはありません
zh_hant: 暫無媒體檔案

# file_list.importing
source: 导入中
en: Importing
ja: 読み込み中
zh_hant: 匯入中

# home.app_subtitle
source: AI 音频降噪工具
en: AI Audio Denoiser
ja: AI音声ノイズ除去ツール
zh_hant: AI 音訊降噪工具

# home.feature.denoise_player.subtitle
source: 实时降噪 · 边播边听
en: Live denoise · Play & listen
ja: リアルタイムでノイズ除去しながら再生
zh_hant: 實時降噪 · 邊播邊聽

# home.feature.denoise_player.title
source: 降噪播放
en: Denoise & Play
ja: ノイズ除去して再生

# home.feature.file_conversion.subtitle
source: 批量降噪 · 导出文件
en: Batch denoise · Export files
ja: 複数ファイルを一括ノイズ除去して書き出し
zh_hant: 批量降噪 · 匯出檔案

# home.feature.file_conversion.title
source: 文件转换
en: File Conversion
ja: ファイル変換
zh_hant: 檔案轉換

# home.footer.version
source: 版本 1.0 · 基于 RNNoise 引擎
en: Version 1.0 · Powered by RNNoise
ja: バージョン 1.0 ・ RNNoise 搭載
zh_hant: 版本 1.0 · 基於 RNNoise 引擎

# home.settings.accessibility
source: 设置
en: Settings
ja: 設定
zh_hant: 設置

# player.action.load_online_file
source: 加载在线文件
en: Load online file
ja: オンラインファイルを読み込む
zh_hant: 加載在線檔案

# player.action.loading
source: 下载中...
en: Downloading...
ja: ダウンロード中...
zh_hant: 下載中...

# player.action.replace_file
source: 更换文件
en: Change file
ja: ファイルを選び直す
zh_hant: 更換檔案

# player.error.cannot_read_audio_data
source: 无法读取音频数据
en: Cannot read audio data
ja: 音声データを読み込めません
zh_hant: 無法讀取音訊數據

# player.error.cannot_read_file
source: 无法读取文件: %@
en: Cannot read file: %@
ja: ファイルを読み込めません: %@
zh_hant: 無法讀取檔案: %@

# player.error.cannot_read_selected_video
source: 无法读取所选视频
en: Cannot read selected video
ja: 選択した動画を読み込めません
zh_hant: 無法讀取所選影片

# player.error.download_failed
source: 下载失败: %@
en: Download failed: %@
ja: ダウンロードに失敗しました: %@
zh_hant: 下載失敗: %@

# player.error.import_album_failed
source: 从相册导入失败: %@
en: Import from album failed: %@
ja: アルバムからの読み込みに失敗しました: %@
zh_hant: 從相簿匯入失敗: %@

# player.error.invalid_http_url
source: 请输入有效的 HTTP/HTTPS 地址
en: Please enter a valid HTTP/HTTPS URL
ja: 有効な HTTP/HTTPS URL を入力してください
zh_hant: 請輸入有效的 HTTP/HTTPS 地址

# player.error.invalid_url
source: 请输入有效的 URL
en: Please enter a valid URL
ja: 有効な URL を入力してください
zh_hant: 請輸入有效的 URL

# player.error.playback_failed
source: 播放失败: %@
en: Playback failed: %@
ja: 再生に失敗しました: %@
zh_hant: 播放失敗: %@

# player.error.remote_unavailable
source: 远程播放器不可用
en: Remote player unavailable
ja: オンライン再生は現在利用できません
zh_hant: 遠程播放器不可用

# player.error.server_error
source: 服务器返回错误 (%d)
en: Server returned error (%d)
ja: サーバーがエラーを返しました (%d)
zh_hant: 服務器返回錯誤 (%d)

# player.error.unsupported_format
source: 不支持的文件格式: .%@
en: Unsupported format: .%@
ja: 非対応の形式です: .%@
zh_hant: 不支持的檔案格式: .%@

# player.metric.fallback_reason
source: 回退原因: %@
en: Fallback reason: %@
ja: 切り替え理由: %@

# player.metric.startup_latency
source: 首帧延迟 %.0f ms
en: First-frame latency %.0f ms
ja: 初回再生まで %.0f ms
zh_hant: 首幀延遲 %.0f ms

# player.online_stream_name
source: 在线流媒体
en: Online Stream
ja: オンラインストリーム
zh_hant: 線上串流媒體

# player.remote.loading_hint
source: 加载完成后将显示播放与降噪控制面板
en: Playback and denoise controls will appear after loading
ja: 読み込み完了後に再生とノイズ除去の操作が表示されます。
zh_hant: 加載完成後將顯示播放與降噪控制面板

# player.remote.loading_title
source: 正在加载在线资源...
en: Loading online resource...
ja: オンラインリソースを読み込み中...
zh_hant: 正在加載在線資源...

# player.section.denoise_settings
source: 降噪设置
en: Denoise settings
ja: ノイズ除去設定
zh_hant: 降噪設置

# player.section.pipeline
source: 播放链路
en: Playback path
ja: 再生モード
zh_hant: 播放鏈路

# player.section.volume
source: 音量
en: Volume

# player.select_file_source
source: 选择文件来源
en: Choose file source
ja: ファイルの取り込み元を選択
zh_hant: 選擇檔案來源

# player.source.from_files
source: 从文件选取
en: From Files
ja: ファイルから
zh_hant: 從檔案選擇

# player.source.from_photos
source: 从相册选取视频
en: From Photo Library
ja: フォトライブラリから
zh_hant: 從相簿選擇影片

# player.state.denoising_playback
source: 降噪播放中
en: Denoise playback
ja: ノイズ除去して再生中

# player.state.disabled
source: 已关闭
en: Disabled
ja: 無効
zh_hant: 已關閉

# player.state.enabled
source: 已启用
en: Enabled
ja: 有効
zh_hant: 已啓用

# player.state.original_playback
source: 原始播放中
en: Original playback
ja: 原音で再生中

# player.state.ready
source: 准备就绪
en: Ready
ja: 再生準備完了
zh_hant: 準備就緒

# player.stream.fallback_download_local
source: 回退：下载后播放
en: Fallback: download then play
ja: フォールバック: 先にダウンロードして再生
zh_hant: 回退：下載後播放

# player.stream.local_file_mode
source: 本地文件模式
en: Local file mode
ja: ローカルファイルモード
zh_hant: 本地檔案模式

# player.stream.remote_denoise
source: 在线真流式（降噪）
en: True streaming (denoised)
ja: ストリーミング再生（ノイズ除去）
zh_hant: 在線真流式（降噪）

# player.stream.remote_loading
source: 在线资源加载中...
en: Loading online resource...
ja: オンラインリソースを読み込み中...
zh_hant: 在線資源加載中...

# player.stream.remote_missing
source: 在线资源不存在或已过期，请更换可访问的音频地址
en: Online resource not found or expired. Please use an accessible audio URL
ja: オンラインリソースが見つからないか期限切れです。アクセス可能な音声URLを使用してください
zh_hant: 在線資源不存在或已過期，請更換可訪問的音訊地址

# player.stream.remote_original
source: 在线真流式（原声）
en: True streaming (original audio)
ja: ストリーミング再生（原音）
zh_hant: 在線真流式（原聲）

# player.stream.startup_slow
source: 首帧偏慢，建议回退策略
en: First frame is slow, fallback is recommended
ja: 初回再生が遅いため、フォールバックをおすすめします
zh_hant: 首幀偏慢，建議回退策略

# player.toggle.enable_denoise
source: 启用降噪
en: Enable denoise
ja: ノイズ除去を有効化
zh_hant: 啓用降噪

# player.url.placeholder
source: 输入在线音频/视频 URL
en: Enter audio/video URL
ja: 音声/動画のURLを入力
zh_hant: 輸入在線音訊/影片 URL

# processing.completed
source: 已完成
en: Completed
ja: 完了

# processing.failed
source: 失败: %@
en: Failed: %@
ja: 失敗: %@
zh_hant: 失敗: %@

# processing.idle
source: 等待处理
en: Waiting
ja: 待機中
zh_hant: 等待處理

# processing.in_progress_percent
source: 处理中 %lld%%
en: Processing %lld%%
ja: 処理中 %lld%%
zh_hant: 處理中 %lld%%

# service.error.asset_reader_start_failed
source: AVAssetReader 启动失败
en: AVAssetReader failed to start
ja: AVAssetReader の開始に失敗しました
zh_hant: AVAssetReader 啟動失敗

# service.error.async_load_timeout
source: 加载 %@ 超时
en: Timed out while loading %@
ja: %@ の読み込みがタイムアウトしました
zh_hant: 載入 %@ 逾時

# service.error.audio_extraction_failed
source: 从视频提取音频失败: %@
en: Failed to extract audio from video: %@
ja: 動画から音声を抽出できませんでした: %@
zh_hant: 從影片擷取音訊失敗: %@

# service.error.audio_processing_failed
source: 音频处理失败: %@
en: Audio processing failed: %@
ja: 音声処理に失敗しました: %@
zh_hant: 音訊處理失敗: %@

# service.error.audio_read_start_failed
source: 音频读取启动失败
en: Audio reader failed to start
ja: 音声リーダーの開始に失敗しました
zh_hant: 音訊讀取啟動失敗

# service.error.audio_tap_create_failed
source: 创建音频处理 Tap 失败
en: Failed to create audio processing tap
ja: 音声処理 Tap の作成に失敗しました
zh_hant: 建立音訊處理 Tap 失敗

# service.error.audio_tap_no_track
source: 没有可用于降噪处理的音轨
en: No audio track available for denoise processing
ja: ノイズ除去処理に使用できる音声トラックがありません
zh_hant: 沒有可用於降噪處理的音軌

# service.error.audio_track_missing
source: 视频文件中未找到音频轨道
en: No audio track found in video file
ja: 動画ファイルに音声トラックが見つかりません
zh_hant: 影片檔案中未找到音訊軌道

# service.error.buffer_creation_failed
source: 无法创建音频缓冲区
en: Cannot create audio buffer
ja: 音声バッファを作成できません
zh_hant: 無法建立音訊緩衝區

# service.error.conversion_failed
source: 音频转换失败: %@
en: Audio conversion failed: %@
ja: 音声変換に失敗しました: %@
zh_hant: 音訊轉換失敗: %@

# service.error.converter_creation_failed
source: 无法创建音频转换器
en: Cannot create audio converter
ja: 音声コンバーターを作成できません
zh_hant: 無法建立音訊轉換器

# service.error.decoded_data_empty
source: 解码后的音频数据为空
en: Decoded audio data is empty
ja: デコード後の音声データが空です
zh_hant: 解碼後的音訊資料為空

# service.error.file_not_found
source: 找不到文件: %@
en: File not found: %@
ja: ファイルが見つかりません: %@
zh_hant: 找不到檔案: %@

# service.error.format_creation_failed
source: 无法创建音频格式
en: Cannot create audio format
ja: 音声フォーマットを作成できません
zh_hant: 無法建立音訊格式

# service.error.incremental_converter_create_failed
source: 无法创建增量音频转换器
en: Failed to create incremental audio converter
ja: 増分音声コンバーターの作成に失敗しました
zh_hant: 無法建立增量音訊轉換器

# service.error.incremental_video_read_failed
source: 增量读取视频音频流失败
en: Failed to read incremental video audio stream
ja: 増分動画音声ストリームの読み取りに失敗しました
zh_hant: 增量讀取影片音訊流失敗

# service.error.input_buffer_creation_failed
source: 无法创建源音频缓冲区
en: Cannot create source audio buffer
ja: ソース音声バッファを作成できません
zh_hant: 無法建立來源音訊緩衝區

# service.error.invalid_duration
source: 无法读取媒体文件时长
en: Cannot read media duration
ja: メディアの再生時間を読み取れません
zh_hant: 無法讀取媒體時長

# service.error.media_load_failed
source: 加载媒体资源失败
en: Failed to load media resource
ja: メディアリソースの読み込みに失敗しました
zh_hant: 載入媒體資源失敗

# service.error.mono_buffer_creation_failed
source: 无法创建单声道音频缓冲区
en: Cannot create mono audio buffer
ja: モノラル音声バッファを作成できません
zh_hant: 無法建立單聲道音訊緩衝區

# service.error.no_media_track
source: 未找到 %@ 轨道
en: No %@ track found
ja: %@ トラックが見つかりません
zh_hant: 未找到 %@ 軌道

# service.error.no_readable_audio_frames
source: 没有可读取的音频帧
en: No readable audio frames
ja: 読み取り可能な音声フレームがありません
zh_hant: 沒有可讀取的音訊影格

# service.error.output_buffer_creation_failed
source: 无法创建输出音频缓冲区
en: Cannot create output audio buffer
ja: 出力音声バッファを作成できません
zh_hant: 無法建立輸出音訊緩衝區

# service.error.output_file_missing
source: 输出文件不存在
en: Output file is missing
ja: 出力ファイルが見つかりません
zh_hant: 輸出檔案不存在

# service.error.processing_cancelled
source: 处理已取消
en: Processing cancelled
ja: 処理がキャンセルされました
zh_hant: 處理已取消

# service.error.read_mono_data_failed
source: 无法读取单声道音频数据
en: Cannot read mono audio data
ja: モノラル音声データを読み取れません
zh_hant: 無法讀取單聲道音訊資料

# service.error.rnnoise_create_failed
source: 初始化 RNNoise 处理器失败
en: Failed to initialize RNNoise processor
ja: RNNoise プロセッサーの初期化に失敗しました
zh_hant: 初始化 RNNoise 處理器失敗

# service.error.rnnoise_model_load_failed
source: 加载 RNNoise 模型失败: %@
en: Failed to load RNNoise model: %@
ja: RNNoise モデルの読み込みに失敗しました: %@
zh_hant: 載入 RNNoise 模型失敗: %@

# service.error.stereo_buffer_creation_failed
source: 无法创建立体声音频缓冲区
en: Cannot create stereo audio buffer
ja: ステレオ音声バッファを作成できません
zh_hant: 無法建立立體聲音訊緩衝區

# service.error.video_audio_data_empty
source: 视频音频轨道无有效数据
en: Video audio track has no valid data
ja: 動画の音声トラックに有効なデータがありません
zh_hant: 影片音訊軌道無有效資料

# service.error.video_audio_decoded_empty
source: 解码后的视频音频数据为空
en: Decoded video audio data is empty
ja: デコード後の動画音声データが空です
zh_hant: 解碼後的影片音訊資料為空

# service.error.video_read_start_failed
source: 视频读取启动失败
en: Video reader failed to start
ja: 動画リーダーの開始に失敗しました
zh_hant: 影片讀取啟動失敗

# service.error.video_track_missing
source: 视频文件中未找到视频轨道
en: No video track found in video file
ja: 動画ファイルに映像トラックが見つかりません
zh_hant: 影片檔案中未找到影片軌道

# service.error.video_write_completion_unexpected
source: 视频写入完成状态异常
en: Video writer completed with unexpected status
ja: 動画ライターが予期しない状態で完了しました
zh_hant: 影片寫入完成狀態異常

# service.error.video_write_failed
source: 视频写入失败: %@
en: Video writing failed: %@
ja: 動画書き込みに失敗しました: %@
zh_hant: 影片寫入失敗: %@

# service.file_picker.message
source: 选择一个或多个音频/视频文件进行降噪
en: Select one or more audio/video files for denoising
ja: ノイズ除去する音声/動画ファイルを1つ以上選択してください
zh_hant: 選擇一個或多個音訊/影片檔案進行降噪

# service.file_picker.title
source: 选择音频或视频文件
en: Select audio or video files
ja: 音声または動画ファイルを選択
zh_hant: 選擇音訊或影片檔案

# service.save_panel.title
source: 导出降噪后的文件
en: Export denoised file
ja: ノイズ除去済みファイルを書き出し
zh_hant: 匯出降噪後的檔案

# settings.language.subtitle.en
source: 推荐全球用户
en: Recommended for global users
ja: グローバルユーザー向け
zh_hant: Recommended for global users

# settings.language.subtitle.ja
source: 推荐日语用户
en: Recommended for Japanese users
ja: 日本語ユーザー向け
zh_hant: 推薦日語用戶

# settings.language.subtitle.zh_hans
source: 推荐中国大陆用户
en: Recommended for users in mainland China
ja: 中国本土のユーザー向け
zh_hant: 推薦中國大陸用戶

# settings.language.subtitle.zh_hant
source: 推薦繁體中文使用者
en: Recommended for Traditional Chinese users
ja: 繁体字中国語ユーザー向け

# settings.language.switched_to
source: 语言已切换为 %@
en: Language switched to %@
ja: 言語を%@に切り替えました
zh_hant: 語言已切換為 %@

# settings.language.title
source: 语言
en: Language
ja: 言語
zh_hant: 語言

# waveform.denoised
source: 降噪后
en: Denoised
ja: ノイズ除去後
zh_hant: 降噪後

# waveform.denoised_pending
source: 降噪后（待处理）
en: Denoised (pending)
ja: ノイズ除去後（処理待ち）
zh_hant: 降噪後（待處理）

# waveform.original_audio
source: 原始音频
en: Original audio
ja: 原音
zh_hant: 原始音訊
